content/notes/20240417-mlflow-qlora.org
#+title: Logging and Loading a QLoRA Model with MLflow
#+date:      <2024-04-17 Wed>

#+begin_preview
This is a minimal example of how to log an MLflow qlora model. It does not show any actual model training or data processing, just the basic process of saving the model.
#+end_preview

* Install Dependencies

#+begin_src python
%pip install --upgrade torch
%pip install --upgrade transformers accelerate peft bitsandbytes mlflow pynvml packaging ninja
#+end_src

#+begin_src python
%sh
cd /databricks/driver/
git clone https://github.com/Dao-AILab/flash-attention.git
cd flash-attention
pip install . --no-build-isolation
#+end_src

(See [[file:20240416-torch-cuda-flash-attn.org][this earlier note]] for more information on installing flash attention)
* Set up assets/cache directories

#+begin_src python
# Some Environment Setup
ASSETS_DIR = "<assets_dir>"
OUTPUT_DIR = ASSETS_DIR + "/results/mistral_qlora_min/" # the path to the output directory; where model checkpoints will be saved
LOG_DIR = ASSETS_DIR + "/logs/mistral_qlora_min/" # the path to the log directory; where logs will be saved
CACHE_DIR = ASSETS_DIR + "/cache/mistral_qlora_min/" # the path to the cache directory; where cache files will be saved
#+end_src
* Skip Data Processing

We are not preparing or using any training data in this example. We are skipping the training part.
* Load the model, tokenizer, etc.
** Tokenizer

#+begin_src python
from transformers import AutoTokenizer
tokenizer = AutoTokenizer.from_pretrained("mistralai/Mistral-7B-v0.1")
#+end_src
** LoRA config

#+begin_src python
from peft import LoraConfig, TaskType

lora_config = LoraConfig(
    r=64,
    target_modules="all-linear",
    task_type=TaskType.CAUSAL_LM,
    lora_alpha=32,
    lora_dropout=0.05
)
#+end_src
** Model
#+begin_src python
from transformers import AutoModelForCausalLM, BitsAndBytesConfig
import torch

bnb_config = BitsAndBytesConfig(
    load_in_4bit=True,
    #bnb_4bit_use_double_quant=True,
    bnb_4bit_compute_dtype=torch.bfloat16,
)

model = AutoModelForCausalLM.from_pretrained(
    "mistralai/Mistral-7B-v0.1",
    trust_remote_code=True,
    cache_dir=CACHE_DIR,
    device_map="auto",
    quantization_config=bnb_config)
#+end_src
