notes/20240417-mlflow-qlora.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Logging and Loading a QLoRA Model with MLflow</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans:wght@400;500;600;700&display=swap" rel="stylesheet">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/notes/20240417-mlflow-qlora.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/notes/20240417-mlflow-qlora.html">
<meta property="og:title" content="Logging and Loading a QLoRA Model with MLflow">
<meta property="og:description" content="This is a minimal example of how to log an MLflow qlora model. It does not show any actual model training or data processing, just the basic process of saving the model.">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2024-04-17T00:00:00Z">
<meta property="article:modified_time" content="2025-10-01T22:46:52Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Logging and Loading a QLoRA Model with MLflow">
<meta name="twitter:description" content="This is a minimal example of how to log an MLflow qlora model. It does not show any actual model training or data processing, just the basic process of saving the model.">
</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Logging and Loading a QLoRA Model with MLflow</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4bca8e7">Install Dependencies</a></li>
<li><a href="#orgfc8825c">Set up assets/cache directories</a></li>
<li><a href="#orgf2dbdaf">Skip Data Processing</a></li>
<li><a href="#orgdc8626c">Load the model, tokenizer, etc.</a>
<ul>
<li><a href="#orgc63d9d2">Tokenizer</a></li>
<li><a href="#org03004c6">LoRA config</a></li>
<li><a href="#org5542926">Model</a></li>
<li><a href="#org5d8713d">Set up the peft model</a></li>
</ul>
</li>
<li><a href="#org2ca8725">Skip Training</a></li>
<li><a href="#org80119db">Log to MLflow</a></li>
<li><a href="#org63c7246">Load the MLflow model</a></li>
<li><a href="#org73c3f7b">Summary</a></li>
</ul>
</div>
</nav>
<div class="preview" id="orgee2a348">
<p>
This is a minimal example of how to log an MLflow qlora model. It does not show any actual model training or data processing, just the basic process of saving the model.
</p>

</div>

<div id="outline-container-org4bca8e7" class="outline-2">
<h2 id="org4bca8e7">Install Dependencies</h2>
<div class="outline-text-2" id="text-org4bca8e7">
<div class="org-src-container">
<pre class="src src-python"><span class="org-operator">%</span>pip install <span class="org-operator">--</span>upgrade torch
<span class="org-operator">%</span>pip install <span class="org-operator">--</span>upgrade transformers accelerate peft bitsandbytes mlflow pynvml packaging ninja
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span class="org-operator">%</span>sh
cd <span class="org-operator">/</span>databricks<span class="org-operator">/</span>driver<span class="org-operator">/</span>
git clone https:<span class="org-operator">//</span>github.com<span class="org-operator">/</span>Dao<span class="org-operator">-</span>AILab<span class="org-operator">/</span>flash<span class="org-operator">-</span>attention.git
cd flash<span class="org-operator">-</span>attention
pip install . <span class="org-operator">--</span>no<span class="org-operator">-</span>build<span class="org-operator">-</span>isolation
</pre>
</div>

<p>
(See <a href="20240416-torch-cuda-flash-attn.html">this earlier note</a> for more information on installing flash attention)
</p>
</div>
</div>
<div id="outline-container-orgfc8825c" class="outline-2">
<h2 id="orgfc8825c">Set up assets/cache directories</h2>
<div class="outline-text-2" id="text-orgfc8825c">
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Some Environment Setup
</span><span class="org-variable-name">ASSETS_DIR</span> <span class="org-operator">=</span> <span class="org-string">"&lt;assets_dir&gt;"</span>
<span class="org-variable-name">OUTPUT_DIR</span> <span class="org-operator">=</span> ASSETS_DIR <span class="org-operator">+</span> <span class="org-string">"/results/mistral_qlora_min/"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">the path to the output directory; where model checkpoints will be saved
</span><span class="org-variable-name">LOG_DIR</span> <span class="org-operator">=</span> ASSETS_DIR <span class="org-operator">+</span> <span class="org-string">"/logs/mistral_qlora_min/"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">the path to the log directory; where logs will be saved
</span><span class="org-variable-name">CACHE_DIR</span> <span class="org-operator">=</span> ASSETS_DIR <span class="org-operator">+</span> <span class="org-string">"/cache/mistral_qlora_min/"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">the path to the cache directory; where cache files will be saved</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2dbdaf" class="outline-2">
<h2 id="orgf2dbdaf">Skip Data Processing</h2>
<div class="outline-text-2" id="text-orgf2dbdaf">
<p>
We are not preparing or using any training data in this example. We are skipping the training part.
</p>
</div>
</div>
<div id="outline-container-orgdc8626c" class="outline-2">
<h2 id="orgdc8626c">Load the model, tokenizer, etc.</h2>
<div class="outline-text-2" id="text-orgdc8626c">
</div>
<div id="outline-container-orgc63d9d2" class="outline-3">
<h3 id="orgc63d9d2">Tokenizer</h3>
<div class="outline-text-3" id="text-orgc63d9d2">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> transformers <span class="org-keyword">import</span> AutoTokenizer
<span class="org-variable-name">tokenizer</span> <span class="org-operator">=</span> AutoTokenizer.from_pretrained(<span class="org-string">"mistralai/Mistral-7B-v0.1"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org03004c6" class="outline-3">
<h3 id="org03004c6">LoRA config</h3>
<div class="outline-text-3" id="text-org03004c6">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> peft <span class="org-keyword">import</span> LoraConfig, TaskType

<span class="org-variable-name">lora_config</span> <span class="org-operator">=</span> LoraConfig(
    r<span class="org-operator">=</span>64,
    target_modules<span class="org-operator">=</span><span class="org-string">"all-linear"</span>,
    task_type<span class="org-operator">=</span>TaskType.CAUSAL_LM,
    lora_alpha<span class="org-operator">=</span>32,
    lora_dropout<span class="org-operator">=</span>0.05
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5542926" class="outline-3">
<h3 id="org5542926">Model</h3>
<div class="outline-text-3" id="text-org5542926">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> transformers <span class="org-keyword">import</span> AutoModelForCausalLM, BitsAndBytesConfig
<span class="org-keyword">import</span> torch

<span class="org-variable-name">bnb_config</span> <span class="org-operator">=</span> BitsAndBytesConfig(
    load_in_4bit<span class="org-operator">=</span><span class="org-constant">True</span>,
    <span class="org-comment-delimiter">#</span><span class="org-comment">bnb_4bit_use_double_quant=True,
</span>    bnb_4bit_compute_dtype<span class="org-operator">=</span>torch.bfloat16,
)

<span class="org-variable-name">model</span> <span class="org-operator">=</span> AutoModelForCausalLM.from_pretrained(
    <span class="org-string">"mistralai/Mistral-7B-v0.1"</span>,
    trust_remote_code<span class="org-operator">=</span><span class="org-constant">True</span>,
    cache_dir<span class="org-operator">=</span>CACHE_DIR,
    device_map<span class="org-operator">=</span><span class="org-string">"auto"</span>,
    quantization_config<span class="org-operator">=</span>bnb_config)
</pre>
</div>
</div>
</div>
