content/notes/20240417-mlflow-qlora.org
* Log to MLflow

(Not all of this is necessary)

#+begin_src python
prompt_template = """<|im_start|>system
You are a helpful assistant and an expert at making coffee.<|im_end|>
<|im_start|>user
{prompt}<|im_end|>
<|im_start|>assistant

"""

from mlflow.models import infer_signature

prompt_template = """<|im_start|>system
You are a helpful assistant and an expert at making coffee.<|im_end|>
<|im_start|>user
{prompt}<|im_end|>
<|im_start|>assistant

"""

# Define the sample input/output
sample_input = "What is two plus two?"
sample_output = prompt_template.format(prompt=sample_input) + "four<|im_end|>\n<|endoftext|>"

# Define the sample parameters
sample_params = {
    "max_new_tokens": 512,
    "repetition_penalty": 1.1,
}

# MLflow infers schema from the provided sample input/output/params
signature = infer_signature(
    model_input=sample_input,
    model_output=sample_output,
    params=sample_params,
)

print(signature)
#+end_src

#+RESULTS
: inputs: 
:   [string (required)]
: outputs: 
:   [string (required)]
: params: 
:   ['max_new_tokens': long (default: 512), 'repetition_penalty': double (default: 1.1)]

#+begin_src python
import mlflow

with mlflow.start_run():
    mlflow.log_params(lora_config.to_dict())
    mlflow.transformers.log_model(
        transformers_model={"model": model, "tokenizer": tokenizer},
        signature=signature,
        artifact_path="model",  # This is a relative path to save model files within MLflow run
        extra_pip_requirements = ["bitsandbytes", "peft"],
    )
#+end_src

Note the message printed at this step:

#+begin_quote
INFO mlflow.transformers: Overriding save_pretrained to False for PEFT models, following the Transformers behavior. The PEFT adaptor and config will be saved, but the base model weights will not and reference to the HuggingFace Hub repository will be logged instead.
#+end_quote

This is 
* Load the MLflow model

#+begin_src python
import mlflow

run_id = "<model_id>"
mlflow_model = mlflow.pyfunc.load_model(f'runs:/{run_id}/model')
#+end_src

This will load the model. We can then use its predict method.

#+begin_src python
mlflow_model.predict("Classify the following as postive, negative, or neutral: 'I had a rotten day!'")
#+end_src

Which returns:

#+begin_src
"Classify the following as postive, negative, or neutral: 'I had a rotten day!'\n* 10.24 Classify the following as postive, negative, or neutral: 'I'm so happy to see you!'\n* 10.25 Classify the following as postive, negative, or neutral: 'I'm so sorry I was late.'\n* 10.26 Classify the following as postive, negative, or neutral: 'I'm so glad you came.'\n* 10.27 Classify the following as postive, negative, or neutral: 'I'm so sorry I didn't call.'\n* 10.28 Classify the following as postive, negative, or neutral: 'I'm so glad you called.'\n* [...]
#+end_src

because we did not actually fine-tune the model to follow any of our instructions.

* Summary

This note showed the basics of how to log and load a peft model with MLflow.
