notes/20240417-mlflow-qlora.html
<div id="outline-container-org80119db" class="outline-2">
<h2 id="org80119db">Log to MLflow</h2>
<div class="outline-text-2" id="text-org80119db">
<p>
(Not all of this is necessary)
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">prompt_template</span> <span class="org-operator">=</span> <span class="org-string">"""&lt;|im_start|&gt;system
You are a helpful assistant and an expert at making coffee.&lt;|im_end|&gt;
&lt;|im_start|&gt;user
{prompt}&lt;|im_end|&gt;
&lt;|im_start|&gt;assistant

"""</span>

<span class="org-keyword">from</span> mlflow.models <span class="org-keyword">import</span> infer_signature

<span class="org-variable-name">prompt_template</span> <span class="org-operator">=</span> <span class="org-string">"""&lt;|im_start|&gt;system
You are a helpful assistant and an expert at making coffee.&lt;|im_end|&gt;
&lt;|im_start|&gt;user
{prompt}&lt;|im_end|&gt;
&lt;|im_start|&gt;assistant

"""</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Define the sample input/output
</span><span class="org-variable-name">sample_input</span> <span class="org-operator">=</span> <span class="org-string">"What is two plus two?"</span>
<span class="org-variable-name">sample_output</span> <span class="org-operator">=</span> prompt_template.<span class="org-builtin">format</span>(prompt<span class="org-operator">=</span>sample_input) <span class="org-operator">+</span> <span class="org-string">"four&lt;|im_end|&gt;</span><span class="org-constant">\n</span><span class="org-string">&lt;|endoftext|&gt;"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Define the sample parameters
</span><span class="org-variable-name">sample_params</span> <span class="org-operator">=</span> {
    <span class="org-string">"max_new_tokens"</span>: 512,
    <span class="org-string">"repetition_penalty"</span>: 1.1,
}

<span class="org-comment-delimiter"># </span><span class="org-comment">MLflow infers schema from the provided sample input/output/params
</span><span class="org-variable-name">signature</span> <span class="org-operator">=</span> infer_signature(
    model_input<span class="org-operator">=</span>sample_input,
    model_output<span class="org-operator">=</span>sample_output,
    params<span class="org-operator">=</span>sample_params,
)

<span class="org-builtin">print</span>(signature)
</pre>
</div>

<p>
#+RESULTS
</p>
<pre class="example">
inputs: 
  [string (required)]
outputs: 
  [string (required)]
params: 
  ['max_new_tokens': long (default: 512), 'repetition_penalty': double (default: 1.1)]
</pre>


<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> mlflow

<span class="org-keyword">with</span> mlflow.start_run():
    mlflow.log_params(lora_config.to_dict())
    mlflow.transformers.log_model(
        transformers_model<span class="org-operator">=</span>{<span class="org-string">"model"</span>: model, <span class="org-string">"tokenizer"</span>: tokenizer},
        signature<span class="org-operator">=</span>signature,
        artifact_path<span class="org-operator">=</span><span class="org-string">"model"</span>,  <span class="org-comment-delimiter"># </span><span class="org-comment">This is a relative path to save model files within MLflow run
</span>        extra_pip_requirements <span class="org-operator">=</span> [<span class="org-string">"bitsandbytes"</span>, <span class="org-string">"peft"</span>],
    )
</pre>
</div>

<p>
Note the message printed at this step:
</p>

<blockquote>
<p>
INFO mlflow.transformers: Overriding save<sub>pretrained</sub> to False for PEFT models, following the Transformers behavior. The PEFT adaptor and config will be saved, but the base model weights will not and reference to the HuggingFace Hub repository will be logged instead.
</p>
</blockquote>

<p>
This is 
</p>
</div>
</div>
<div id="outline-container-org63c7246" class="outline-2">
<h2 id="org63c7246">Load the MLflow model</h2>
<div class="outline-text-2" id="text-org63c7246">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> mlflow

<span class="org-variable-name">run_id</span> <span class="org-operator">=</span> <span class="org-string">"&lt;model_id&gt;"</span>
<span class="org-variable-name">mlflow_model</span> <span class="org-operator">=</span> mlflow.pyfunc.load_model(f<span class="org-string">'runs:/</span>{run_id}<span class="org-string">/model'</span>)
</pre>
</div>

<p>
This will load the model. We can then use its predict method.
</p>

<div class="org-src-container">
<pre class="src src-python">mlflow_model.predict(<span class="org-string">"Classify the following as postive, negative, or neutral: 'I had a rotten day!'"</span>)
</pre>
</div>

<p>
Which returns:
</p>

<pre class="example">
"Classify the following as postive, negative, or neutral: 'I had a rotten day!'\n* 10.24 Classify the following as postive, negative, or neutral: 'I'm so happy to see you!'\n* 10.25 Classify the following as postive, negative, or neutral: 'I'm so sorry I was late.'\n* 10.26 Classify the following as postive, negative, or neutral: 'I'm so glad you came.'\n* 10.27 Classify the following as postive, negative, or neutral: 'I'm so sorry I didn't call.'\n* 10.28 Classify the following as postive, negative, or neutral: 'I'm so glad you called.'\n* [...]
</pre>

<p>
because we did not actually fine-tune the model to follow any of our instructions.
</p>
</div>
</div>

<div id="outline-container-org73c3f7b" class="outline-2">
<h2 id="org73c3f7b">Summary</h2>
<div class="outline-text-2" id="text-org73c3f7b">
<p>
This note showed the basics of how to log and load a peft model with MLflow.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-04-17 Wed 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
